# name = input('Как тебя зовут? ')
# print(f'Привет! {name}')

###############################################################################

# cost = 145
# money = 200

# print(money // cost, 'купили вещей')
# print(money % cost, 'осталось денег')

###############################################################################

# Задача 1

# n = int(input('Введите колличество километров которые проежает машина за день: '))
# m = int(input('Введите длину маршрута: '))

# result = m // n + int(m % n > 0)
# print(f'Машина проезжает марштур за {result} дня')

###############################################################################

# Задача 2

# class_1 = int(input('ВВедите количество учеников для первого класса: '))
# class_2 = int(input('ВВедите количество учеников для второго класса: '))
# class_3 = int(input('ВВедите количество учеников для третьеого класса: '))

# parts_1 = (class_1 // 2 + class_1 % 2)
# parts_2 = (class_2 // 2 + class_2 % 2)
# parts_3 = (class_3 // 2 + class_3 % 2)

# print(f'Колличество парт для первого класса - {parts_1}, для второго - {parts_2}, для тертьего класса - {parts_3}.')

###############################################################################

# Задача 3

# i = int(input('Введите номер вагона '))
# j = int(input('Введите текущий номер вагона '))

# if i == j:
#     print('Недостаточно данных для посчета')
# else:
#     print(j + i + 1)

###############################################################################

# Задача 4
# Калькулятор високосного года

# years = int(input('Введите год '))

# if years % 4 == 0 and years % 100 != 0 or years % 400 == 0:
#     print('YES')
# else:
#     print('NO')

###############################################################################

# Задача 5

# x = int(input('Введите рост 1-го человека '))
# y = int(input('Введите рост 2-го человека '))
# z = int(input('Введите рост 3-го человека '))

# if x < y:
#     x, y = y, x
# if y < z:
#     y, z = z, y
# if x < y:
#     x, y = y, x

# print(x, y, z)

###############################################################################

